Revit 2026 API

# EdgeEndPoint Properties

---

The EdgeEndPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Edge | The Edge. |
|  | Index | The index of the start or the end point of an Edge: 0 is the start point, 1 is the end point. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

EdgeEndPoint Class

Autodesk.Revit.DB Namespace